Revit 2026 API
LightType Class
 This class encapsulates light information.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.LightType
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class LightType : IDisposable
Public Class LightType
	Implements IDisposable
public ref class LightType : IDisposable
type LightType =
    class
        interface IDisposable
    end
The LightType type exposes the following members.
Properties
Name | Description
ColorFilter |  The light filter color.
DimmingColor |  The dimming temperature value in Kelvins.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the LightType
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetInitialColor |  Return a copy of an object derived from InitialColor
GetInitialIntensity |  Return a copy of an object derived from InitialIntensity
GetLightDistribution |  Return a copy of an object derived from LightDistribution
GetLightShape |  Return a copy of an object derived from LightShape
GetLightType |  Creates a light type object from the given document and family type ID
GetLightTypeFromInstance |  Creates a light type object from the given document and element ID
GetLossFactor |  Return a copy of an object derived from LossFactor
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetInitialColor |  Replace the current initial color object with the given object
SetInitialIntensity |  Replace the current initial intensity object with the given object
SetLightDistribution |  Replace the current LightDistribution object with the given object
SetLightShape |  Replace the current LightShape object with the given object
SetLossFactor |  Replace the current loss factor object with the given object
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.Lighting Namespace